#include "CCourseMgr.h"
#include <time.h>
#include "CMyQueue.h"

const char* CourseNames[] =
{ "语言及应用", "概论", "大型作业", "课程设计", "射线与电镜", "汇编语言程序设计", "板壳理论", "板壳力学", "半波实验", "半导体变流技术", "半导体材料", "半导体测量", "半导体瓷敏元件", "半导体光电子学", "半导体化学", "半导体激光器", "半导体集成电路", "半导体理论", "半导体器件", "半导体器件工艺原理", "半导体物理", "半导体专业", "半导体专业实验", "薄膜光学", "报告文学专题", "报刊编辑学", "报纸编辑学", "泵与风机", "泵与水机", "毕业设计", "编译方法", "编译技术", "编译原理", "变电站的微机检测与控制", "变分法与张量", "变分学", "变质量系统热力学与新型回转压", "表面活性物质", "并行算法", "波谱学", "材料的力学性能测试", "材料力学", "财务成本管理", "财政学", "财政与金融", "财政与信贷", "操作系统", "操作系统课程设计", "操作系统原理", "策波测量技术", "测量原理与仪器设计", "测试技术", "测试与信号变换处理", "产业经济学", "产业组织学", "场论", "常微分方程", "超导磁体及应用", "超导及应用", "超精微细加工", "城市规划原理", "城市社会学", "成组技术", "齿轮啮合原理", "冲击测量及误差", "冲压工艺", "抽象代数", "传动概论", "传感器与检测技术", "传感器原理", "传感器原理及应用", "传热学", "传坳概论", "船舶操纵", "船舶电力系统", "船舶电力系统课程设计", "船舶电气传动自动化", "船舶电站", "船舶动力装置", "船舶概论", "船舶焊接与材料", "船舶机械控制技术", "船舶机械拖动", "船舶建筑美学", "船舶结构力学", "船舶结构与制图", "船舶静力学", "船舶强度与结构设计", "船舶设计原理", "船舶推进", "船舶摇摆", "船舶阻力", "船体建造工艺", "船体结构", "船体结构图", "船体振动学", "创造心理学", "磁测量技术", "磁传感器", "磁存储设备设计原理", "磁记录技术", "磁记录物理", "磁路设计与场计算", "磁盘控制器", "磁性材料", "磁性测量", "磁性物理", "磁原理及应用", "大电流测量", "大电源测量", "大机组协调控制", "大跨度房屋结构", "大型锅炉概况", "大型火电机组控制", "大学德语", "大学俄语", "大学法语", "船舶操纵", "船舶电力系统", "船舶电力系统课程设计", "船舶电气传动自动化", "船舶电站", "船舶动力装置", "船舶概论", "船舶焊接与材料", "船舶机械控制技术", "船舶机械拖动", "船舶建筑美学", "船舶结构力学", "船舶结构与制图", "船舶静力学", "船舶强度与结构设计", "船舶设计原理", "船舶推进", "船舶摇摆", "船舶阻力", "船体建造工艺", "船体结构", "船体结构图", "船体振动学", "创造心理学", "磁测量技术", "磁传感器", "磁存储设备设计原理", "磁记录技术", "磁记录物理", "磁路设计与场计算", "磁盘控制器", "磁性材料", "磁性测量", "磁性物理", "磁原理及应用", "大电流测量", "大电源测量", "大机组协调控制", "大跨度房屋结构", "大型锅炉概况", "大型火电机组控制", "大学德语", "大学俄语", "大学法语", "大学日语", "大学英语", "大学语文", "大众传播学", "代用运放电路", "单片机原理", "单片机原理及应用", "弹性力学", "当代国际关系", "当代国外社会思维评价", "当代文学", "当代文学专题", "当代西方哲学", "当代戏剧与电影", "党史", "导波光学", "等离子体工程", "低频电子线路", "低温传热学", "低温固体物理", "低温技术原理与装置", "低温技术中的微机原理", "低温绝热", "低温气体制冷机", "低温热管", "低温设备", "低温生物冻干技术", "低温实验技术", "低温物理导论", "低温物理概论", "低温物理概念", "低温仪表及测试", "低温原理", "低温中的微机应用", "低温装置", "低噪声电子电路", "低噪声电子设计", "低噪声放大与弱检", "低噪声与弱信号检测", "地理", "第二次世界大战史", "电测量技术", "电厂计算机控制系统", "电磁测量实验技术", "电磁场计算机", "电磁场理论", "电磁场数值计算", "电磁场与电磁波", "电磁场与微波技术", "电磁场中的数值方法", "电磁场中的数值计算", "电磁学", "电动力学", "电镀", "电分析化学", "电工测试技术基础", "电工产品学", "电工电子技术基础", "电工电子学", "电工基础", "电工基础理论", "电工基础实验", "电工技术", "电工技术基础", "电工实习", "电工实验技术基础", "电工学", "电工与电机控制", "电弧电接触", "电弧焊及电渣焊", "电化学测试技术", "电化学工程", "电化学工艺学", "电机测试技术", "电机电磁场的分析与计算", "电机电器与供电", "电机课程设计", "电机绕组理论", "电机绕组理论及应用", "电机设计", "电机瞬变过程", "电机学", "电机学及控制电机", "电机与拖动", "电机原理", "电机原理与拖动", "电机专题", "大学日语", "大学英语", "大学语文", "大众传播学", "代用运放电路", "单片机原理", "单片机原理及应用", "弹性力学", "当代国际关系", "当代国外社会思维评价", "当代文学", "当代文学专题", "当代西方哲学", "当代戏剧与电影", "党史", "导波光学", "等离子体工程", "低频电子线路", "低温传热学", "低温固体物理", "低温技术原理与装置", "低温技术中的微机原理", "低温绝热", "低温气体制冷机", "低温热管", "低温设备", "低温生物冻干技术", "低温实验技术", "低温物理导论", "低温物理概论", "低温物理概念", "低温仪表及测试", "低温原理", "低温中的微机应用", "低温装置", "低噪声电子电路", "低噪声电子设计", "低噪声放大与弱检", "低噪声与弱信号检测", "地理", "第二次世界大战史", "电测量技术", "电厂计算机控制系统", "电磁测量实验技术", "电磁场计算机", "电磁场理论", "电磁场数值计算", "电磁场与电磁波", "电磁场与微波技术", "电磁场中的数值方法", "电磁场中的数值计算", "电磁学", "电动力学", "电镀", "电分析化学", "电工测试技术基础", "电工产品学", "电工电子技术基础", "电工电子学", "电工基础", "电工基础理论", "电工基础实验", "电工技术", "电工技术基础", "电工实习", "电工实验技术基础", "电工学", "电工与电机控制", "电弧电接触", "电弧焊及电渣焊", "电化学测试技术", "电化学工程", "电化学工艺学", "电机测试技术", "电机电磁场的分析与计算", "电机电器与供电", "电机课程设计", "电机绕组理论", "电机绕组理论及应用", "电机设计", "电机瞬变过程", "电机学", "电机学及控制电机", "电机与拖动", "电机原理", "电机原理与拖动", "电机专题", "电接触与电弧", "电介质物理", "电镜", "电力电子电路", "电力电子电器", "电力电子器件", "电力电子学", "电力工程", "电力生产技术", "电力生产优化管理", "电力拖动基础", "电力拖动控制系统", "电力系统", "电力系统电源最优化规划", "电力系统短路", "电力系统分析", "电力系统规划", "电力系统过电压", "电力系统继电保护原理", "电力系统经济分析", "电力系统经济运行", "电力系统可靠性", "电力系统可靠性分析", "电力系统无功补偿及应用", "电力系统谐波", "电力系统优化技术", "电力系统优化设计", "电力系统远动", "电力系统远动技术", "电力系统运行", "电力系统自动化", "电力系统自动装置", "电路测试技术", "电路测试技术基础", "电路测试技术及实验", "电路分析基础", "电路分析基础实验", "电路分析实验", "电路和电子技术", "电路理论", "电路理论基础", "电路理论实验", "电路设计与测试技术", "电器学", "电接触与电弧", "电介质物理", "电镜", "电力电子电路", "电力电子电器", "电力电子器件", "电力电子学", "电力工程", "电力生产技术", "电力生产优化管理", "电力拖动基础", "电力拖动控制系统", "电力系统", "电力系统电源最优化规划", "电力系统短路", "电力系统分析", "电力系统规划", "电力系统过电压", "电力系统继电保护原理", "电力系统经济分析", "电力系统经济运行", "电力系统可靠性", "电力系统可靠性分析", "电力系统无功补偿及应用", "电力系统谐波", "电力系统优化技术", "电力系统优化设计", "电力系统远动", "电力系统远动技术", "电力系统运行", "电力系统自动化", "电力系统自动装置", "电路测试技术", "电路测试技术基础", "电路测试技术及实验", "电路分析基础", "电路分析基础实验", "电路分析实验", "电路和电子技术", "电路理论", "电路理论基础", "电路理论实验", "电路设计与测试技术", "电器学", "电器与控制", "电气控制技术", "电视接收技术", "电视节目", "电视节目制作", "电视新技术", "电视原理", "电网调度自动化", "电影艺术", "电站微机检测控制", "电子材料与元件测试技术", "电子材料元件", "电子材料元件测量", "电子测量与实验技术", "电子测试", "电子测试技术", "电子测试技术与实验", "电子机械运动控制技术", "电子技术", "电子技术腐蚀测试中的应用", "电子技术基础", "电子技术基础与实验", "电子技术课程设计", "电子技术实验", "电子理论实验", "电子显微分析", "电子显微镜", "电子线路", "电子线路设计与测试技术", "电子线路实验", "电子照相技术", "雕塑艺术欣赏", "调节装置", "动态规划", "动态无损检测", "动态信号分析与仪器", "锻压工艺", "锻压机械液压传动", "锻压加热设备", "锻压设备专题", "锻压系统动力学", "锻造工艺", "断裂力学", "对外贸易概论", "多层网络方法", "多目标优化方法", "多项距阵", "多元统计分析", "发电厂", "发电厂电气部分", "法律基础", "法学概论", "法学基础", "翻译", "翻译理论与技巧", "泛函分析", "房屋建筑学", "非电量测量", "非金属材料", "非线性采样系统", "非线性光学", "非线性规划", "非线性振荡", "非线性振动", "沸腾燃烧", "分析化学", "分析化学实验", "分析力学", "风机调节", "风机调节", "使用", "运转", "风机三元流动理论与设计", "风能利用", "腐蚀电化学实验", "复变函数", "复变函数与积分变换", "复合材料力学", "傅里叶光学", "概率论", "概率论与数理统计", "概率论与随机过程", "钢笔画", "钢的热处理", "钢结构", "钢筋混凝土", "钢筋混凝土及砖石结构", "钢砼结构", "高层建筑基础设计", "对外贸易概论", "多层网络方法", "多目标优化方法", "多项距阵", "多元统计分析", "发电厂", "发电厂电气部分", "法律基础", "法学概论", "法学基础", "翻译", "翻译理论与技巧", "泛函分析", "房屋建筑学", "非电量测量", "非金属材料", "非线性采样系统", "非线性光学", "非线性规划", "非线性振荡", "非线性振动", "沸腾燃烧", "分析化学", "分析化学实验", "分析力学", "风机调节", "风机调节", "使用", "运转", "风机三元流动理论与设计", "风能利用", "腐蚀电化学实验", "复变函数", "复变函数与积分变换", "复合材料力学", "傅里叶光学", "概率论", "概率论与数理统计", "概率论与随机过程", "钢笔画", "钢的热处理", "钢结构", "钢筋混凝土", "钢筋混凝土及砖石结构", "钢砼结构", "高层建筑基础设计", "高层建筑结构设计", "高等材料力学", "高等代数", "高等教育管理", "高等教育史", "高等教育学", "高等数学", "高电压技术", "高电压测试技术", "高分子材料", "高分子材料及加工", "高分子化学", "高分子化学实验", "高分子物理", "高分子物理实验", "高级英语听说", "高能密束焊", "高频电路", "高频电子技术", "高频电子线路", "高压测量技术", "高压测试技术", "高压电场的数值计算", "高压电器", "高压绝缘", "高压实验", "高压试验技术", "工程材料的力学性能测试", "工程材料及热处理", "工程材料学", "工程测量", "工程测试技术", "工程测试实验", "工程测试信息", "工程动力学", "工程概论", "工程概预算", "工程经济学", "工程静力学", "工程力学", "工程热力学", "工程项目评估", "工程优化方法", "工程运动学", "工程造价管理", "工程制图", "工业分析", "工业锅炉", "工业会计学", "工业机器人", "工业技术基础", "工业建筑设计原理", "工业经济理论", "工业经济学", "工业企业财务管理", "工业企业财务会计", "工业企业管理", "工业企业经营管理", "工业社会学", "工业心理学", "工业窑炉", "工艺过程自动化", "公差", "公差技术测量", "公差与配合", "公共关系学", "公文写作", "古代汉语", "古典文学作品选读", "固体激光", "固体激光器件", "固体激光与电源", "固体物理", "管理概论", "管理经济学", "管理数学", "管理系统模拟", "管理心理学", "管理信息系统", "光波导理论", "光电技术", "光电信号处理", "光电信号与系统分析", "光辐射探测技术", "光谱", "光谱分析", "光谱学", "光纤传感", "工程造价管理", "工程制图", "工业分析", "工业锅炉", "工业会计学", "工业机器人", "工业技术基础", "工业建筑设计原理", "工业经济理论", "工业经济学", "工业企业财务管理", "工业企业财务会计", "工业企业管理", "工业企业经营管理", "工业社会学", "工业心理学", "工业窑炉", "工艺过程自动化", "公差", "公差技术测量", "公差与配合", "公共关系学", "公文写作", "古代汉语", "古典文学作品选读", "固体激光", "固体激光器件", "固体激光与电源", "固体物理", "管理概论", "管理经济学", "管理数学", "管理系统模拟", "管理心理学", "管理信息系统", "光波导理论", "光电技术", "光电信号处理", "光电信号与系统分析", "光辐射探测技术", "光谱", "光谱分析", "光谱学", "光纤传感", "光纤传感器", "光纤传感器基础", "光纤传感器及应用", "光纤光学课程设计", "光纤技术实验", "光纤通信基础", "光学", "光学测量", "光学分析法", "光学计量仪器设计", "光学检测", "光学设计", "光学信息导论", "光学仪器设计", "光学仪器与计量仪器设计", "光学仪器装配与校正", "广播编辑学", "广播新闻", "广播新闻采写", "广告学", "锅炉燃烧理论", "锅炉热交换传热强化", "锅炉原理", "国际金融", "国际经济法", "国际贸易", "国际贸易地理", "国际贸易实务", "国际市场学", "国际市场营销", "国民经济计划", "国外社会学理论", "过程", "控制", "调节装置", "过程调节系统", "过程控制", "过程控制系统", "海洋测量", "海洋工程概论", "函数分析", "焊接方法", "焊接方法及设备", "焊接检验", "焊接结构", "焊接金相", "焊接金相分析", "焊接冶金", "焊接原理", "焊接原理及工艺", "焊接自动化", "汉语", "汉语与写作", "汉语语法研究", "汉字信息处理技术", "毫微秒脉冲技术", "核动力技术", "合唱与指挥", "合金钢", "宏观经济学", "宏微观经济学", "红外", "红外电荷耦合器", "红外探测器", "红外物理", "红外物理与技术", "红外系统", "红外系统电信号处理", "厚薄膜集成电路", "弧焊电源", "弧焊原理", "互换性技术测量基础", "互换性技术测量", "互换性与技术测量", "互换性与技术测量实验", "画法几何及机械制图", "画法几何与阴影透视", "化工基础", "化工仪表与自动化", "化工原理", "化学", "化学反应工程", "化学分离", "化学工程基础", "化学计量学", "化学文献", "化学文献及查阅方法", "化学粘结剂", "环境保护理论基础", "环境化学", "焊接金相分析", "焊接冶金", "焊接原理", "焊接原理及工艺", "焊接自动化", "汉语", "汉语与写作", "汉语语法研究", "汉字信息处理技术", "毫微秒脉冲技术", "核动力技术", "合唱与指挥", "合金钢", "宏观经济学", "宏微观经济学", "红外", "红外电荷耦合器", "红外探测器", "红外物理", "红外物理与技术", "红外系统", "红外系统电信号处理", "厚薄膜集成电路", "弧焊电源", "弧焊原理", "互换性技术测量基础", "互换性技术测量", "互换性与技术测量", "互换性与技术测量实验", "画法几何及机械制图", "画法几何与阴影透视", "化工基础", "化工仪表与自动化", "化工原理", "化学", "化学反应工程", "化学分离", "化学工程基础", "化学计量学", "化学文献", "化学文献及查阅方法", "化学粘结剂", "环境保护理论基础", "环境化学", "环境行为概论", "换热器", "回旧分析与试验设计", "回转式压缩机", "回转压缩机数学模型", "会计学", "会计与财务分析", "会计与设备分析", "会计原理及外贸会计", "会计原理与工业会计", "活力学", "活塞膨胀机", "活塞式制冷压缩机", "活塞式压缩机", "活塞式压缩机基础设计", "活塞压缩机结构强度", "活赛压机气流脉动", "货币银行学", "基本电路理论", "基础写作", "机床电路", "机床电器", "机床电气控制", "机床动力学", "机床设计", "机床数字控制", "机床液压传动", "机电传动", "机电传动控制", "机电耦合系统", "机电系统计算机仿真", "机电一体化", "机构学", "机器人", "机器人控制技术", "机械产品学", "机械产品造型设计", "机械工程控制基础", "机械加工自动化", "机械可靠性", "机械零件", "机械零件设计", "机械零件设计基础", "机械设计", "机械设计基础", "机械设计课程设计", "机械设计原理", "机械式信息传输机构", "机械原理", "机械原理和机械零件", "机械原理及机械设计", "机械原理及应用", "机械原理课程设计", "机械原理与机械零件", "机械原理与机械设计", "机械噪声控制", "机械制造概论", "机械制造工艺学", "机械制造基础", "机械制造基础", "金属工艺学", "机械制造系统自动化", "机械制造中计算机控制", "机制工艺及夹具", "积分变换", "积分变换及数理方程", "积分变换控制工程", "积分变换与动力工程", "激光电源", "激光焊", "激光基础", "激光技术", "激光加工", "激光器件", "激光器件与电源", "激光原理", "激光原理与技术", "极限分析", "集合论与代数结构", "技术管理", "技术经济", "技术经济学", "技术市场学", "计量经济学", "计算方法", "计算机导论", "计算机导论与实践", "计算机辅助设计", "计算机辅助设计与仿真", "机械设计基础", "机械设计课程设计", "机械设计原理", "机械式信息传输机构", "机械原理", "机械原理和机械零件", "机械原理及机械设计", "机械原理及应用", "机械原理课程设计", "机械原理与机械零件", "机械原理与机械设计", "机械噪声控制", "机械制造概论", "机械制造工艺学", "机械制造基础", "机械制造基础", "金属工艺学", "机械制造系统自动化", "机械制造中计算机控制", "机制工艺及夹具", "积分变换", "积分变换及数理方程", "积分变换控制工程", "积分变换与动力工程", "激光电源", "激光焊", "激光基础", "激光技术", "激光加工", "激光器件", "激光器件与电源", "激光原理", "激光原理与技术", "极限分析", "集合论与代数结构", "技术管理", "技术经济", "技术经济学", "技术市场学", "计量经济学", "计算方法", "计算机导论", "计算机导论与实践", "计算机辅助设计", "计算机辅助设计与仿真", "计算机辅助语言教学", "计算机辅助制造", "计算机概论", "计算机绘图", "计算机基础", "计算机接口技术", "计算机接口与通讯", "计算机局域网", "计算机控制", "计算机设计自动化", "计算机实践", "计算机数据库", "计算机算法基础", "计算机图形显示", "计算机图形学", "计算机网络", "计算机系统结构", "计算机语言处理", "计算机原理", "计算机在化学中的应用", "计算机组成原理", "计算力学", "计算力学基础", "计算流体", "继电保护新技术", "继电保护原理", "继电保护运行", "检测技术", "检测系统动力学", "检测与控制", "简明社会学", "简明世界史", "减振设计", "渐近方法", "建筑材料", "建筑初步", "建筑防火", "建筑概论", "建筑构造", "建筑结构", "建筑结构抗震设计", "建筑经济与企业管理", "建筑力学", "建筑名作欣赏", "建筑入门", "建筑摄影", "建筑设备", "建筑设计", "建筑施工", "建筑绘画", "建筑物理", "建筑制图", "胶体化学", "交流调速系统", "教育心理学", "接口与控制器", "接口与通讯", "结构程序设计", "结构动力学", "结构化学", "结构检验", "结构力学", "结构素描", "结构塑性分析", "结构稳定", "结构先进技术", "结构优化理论", "结构优化设计", "解析几何", "介质波导", "介质测量", "介质光学", "金属", "射线学", "金属材料焊接", "金属材料学", "金属材料与热处理", "金属腐蚀与保护", "金属腐蚀原理", "金属工艺学", "金属焊接性基础", "金属焊接原理", "金属机械性能", "金属力学性能", "金属切削机床", "金属切削原理及刀具", "金属熔焊原理", "金属熔焊原理及工艺", "金属熔炼", "建筑入门", "建筑摄影", "建筑设备", "建筑设计", "建筑施工", "建筑绘画", "建筑物理", "建筑制图", "胶体化学", "交流调速系统", "教育心理学", "接口与控制器", "接口与通讯", "结构程序设计", "结构动力学", "结构化学", "结构检验", "结构力学", "结构素描", "结构塑性分析", "结构稳定", "结构先进技术", "结构优化理论", "结构优化设计", "解析几何", "介质波导", "介质测量", "介质光学", "金属", "射线学", "金属材料焊接", "金属材料学", "金属材料与热处理", "金属腐蚀与保护", "金属腐蚀原理", "金属工艺学", "金属焊接性基础", "金属焊接原理", "金属机械性能", "金属力学性能", "金属切削机床", "金属切削原理及刀具", "金属熔焊原理", "金属熔焊原理及工艺", "金属熔炼", "金属塑性成形原理", "金属物理性能", "金属学", "金属学与热处理", "金属学原理", "金相分析", "金相技术", "近代光学测试技术", "近代光学计量技术", "近代经济史", "近代物理实验", "近世代数", "晶体管原理", "晶体光学", "精密测量技术", "精密电气测量", "精密合金", "精密机械", "精密机械课程设计", "精密机械零件", "精密机械设计基础", "精密机械学", "精细有机合成", "经济地理", "经济法", "经济法学", "经济分析基础", "经济控制论", "经济社会学", "经济新闻", "经济学说史", "经济学原理", "经济预测", "经济预测与管理奖惩", "经济原理", "经济运筹学", "经济增长理论", "经营管理", "经营管理学", "静力学", "纠错编码", "决策分析", "绝缘在线检测", "军事理论", "抗干扰技术", "科技翻译", "科技管理", "科技史", "科技史及新技术知识", "科技写作", "科技新闻", "科技英语", "科技英语基础", "科技英语阅读", "科技与社会", "科学方法论", "科学技术史", "科学计量", "科学社会学概论", "科学社会主义", "科学思维方法", "科学学", "可计算性", "可靠性", "可靠性及故障诊断", "可靠性技术导论", "可靠性数学", "可靠性物理", "可逆式机组", "可逆式水力机械", "空气调节与通风", "空气动力学", "控制电机", "控制工程", "控制工程基础", "控制理论", "控制理论基础", "控制理论基础与水轮机调节", "控制系统设计", "控制系统数字仿真", "口译", "口语实践", "快速阅读", "劳动工资管理", "乐理", "雷达原理", "雷电静电及环境", "抗干扰技术", "科技翻译", "科技管理", "科技史", "科技史及新技术知识", "科技写作", "科技新闻", "科技英语", "科技英语基础", "科技英语阅读", "科技与社会", "科学方法论", "科学技术史", "科学计量", "科学社会学概论", "科学社会主义", "科学思维方法", "科学学", "可计算性", "可靠性", "可靠性及故障诊断", "可靠性技术导论", "可靠性数学", "可靠性物理", "可逆式机组", "可逆式水力机械", "空气调节与通风", "空气动力学", "控制电机", "控制工程", "控制工程基础", "控制理论", "控制理论基础", "控制理论基础与水轮机调节", "控制系统设计", "控制系统数字仿真", "口译", "口语实践", "快速阅读", "劳动工资管理", "乐理", "雷达原理", "雷电静电及环境", "冷冻干燥技术", "冷冻技术", "冷库设计", "离散数学", "离心泵与轴流泵", "离心式压缩机模拟", "离心式压缩机强度", "离心式压缩机原理", "理论力学", "力热学", "力学", "热学", "力学性能测试", "两相流动和传热", "量子力学", "劣质煤燃烧与利用", "零件设计", "领导科学", "流场数值计算及性能预测", "流态化工程", "流体力学", "六朝文论", "鲁迅研究", "轮机概论", "伦理学", "论文写作", "论文指导", "螺杆压缩机", "逻辑设计", "逻辑学", "马克思主义原理", "马列", "社会学", "原著选读", "马列哲学原著选读", "马列主义原理", "马氏规划", "脉冲功率放大", "脉冲与数字电路", "毛泽东思想哲学研究", "煤粉燃烧技术及测量技术", "美国文学作品选读", "美术粉彩", "美术室外建筑写生", "美术素描", "美学概论", "秘书学", "密封技术", "免疫学", "敏感元件及材料", "明清小说研究", "名篇赏析", "模糊数学", "模具计算机辅助设计", "模拟电子技术", "模拟电子技术基础", "模拟电子线路", "模拟集成电路", "模式识别", "模型辨识", "磨削原理", "耐腐蚀非金属材料", "内燃机测试技术", "内燃机调节", "内燃机动力学", "内燃机概论", "内燃机排气净化", "内燃机设计", "内燃机原理", "内燃机制造工艺学", "能源工程", "扭转振动", "排压力波计算", "配位化学", "疲劳断裂力学", "偏微分方程", "偏微分方程数值解", "评报", "评论写作", "普通化学", "普通生物学", "普通物理", "普通物理实验", "企业供销管理", "企业管理", "企业管理与技术经济", "企业经营经济学", "企业社会学", "企业生产物流", "企业物流", "气阀原理" };

CCourseMgr::CCourseMgr()
{
  isChange = false;
  FILE *fp = fopen(FILE_COURSETREE, "r");
  if (fp == nullptr)
  {
    generate();
    write();
  }
  else
  {
    read();
    fclose(fp);
  }
}

CCourseMgr::~CCourseMgr()
{
}

int CCourseMgr::AddCourse(const char * szName)
{
  //新id
  int nId = COURSEID_START;
  //查找最大ID
  tagCourseId *tmp = m_CourseIdTree.GetMax();
  if (tmp != nullptr)
  {
    nId = tmp->m_nId + 1;
  }
  //课程对象
  tagCourseId *course = new tagCourseId(nId, szName);
  if (course != nullptr)
  {
    m_CourseIdTree.insert(course);
    m_CourseNameTree.insert(new tagCourseName(nId, szName));
    write();
    return nId;
  }
  return 0;
}

bool CCourseMgr::DelCourse(int nId)
{
  tagCourse *pCourse = FindCourse(nId);
  bool bRet = false;
  if (pCourse != nullptr)
  {
    bRet = m_CourseIdTree.Delete(&tagCourseId(nId, ""));
    m_CourseNameTree.Delete(&tagCourseName(pCourse->m_nId, pCourse->m_strName));
  }
  if (bRet != false)
  {
    //写文件
    write();
  }
  return bRet;
}

void CCourseMgr::Menu()
{
  int nOption = 0;

  while (true)
  {
    system("cls");

    printf("    课程管理\r\n");
    printf("\r\n");
    printf("      1.增加课程\r\n\r\n");
    printf("      2.删除课程\r\n\r\n");
    printf("      3.查询课程\r\n\r\n");
    printf("      0.返回上一级\r\n\r\n");
    printf("\r\n");
    printf("请输入序号,按回车选择:");

    scanf("%d", &nOption);
    getchar();

    int nId = 0;
    char szName[20] = { 0 };

    switch (nOption)
    {
    case 1:
    {
      printf("请输入课程名:");
      scanf("%20s", szName);
      getchar();
      //添加课程
      int nTid = AddCourse(szName);
      if (nTid != 0)
      {
        printf("\r\n%d\t\t%s\r\n", nTid, szName);
        printf("添加成功!\r\n\r\n");
      }
      getchar();
    }
    break;
    case 2:
    {
      printf("请输入课程号:");
      scanf("%d", &nId);
      getchar();

      tagCourse *pcourse = FindCourse(nId);
      if (pcourse != nullptr)
      {
        printf("\r\n%d\t\t%s\r\n", pcourse->m_nId, pcourse->m_strName.GetStr());
        if (DelCourse(nId))
        {
          printf("删除成功!");
        }
      }
      else
      {
        printf("没有这个课程!\r\n");
      }
      getchar();
    }
    break;
    case 3:
    {
      system("cls");
      printf("\r\n");
      printf("1.通过课程ID查询课程\r\n\r\n");
      printf("2.通过课程课程名查询课程\r\n\r\n");
      printf("3.查看课程\r\n\r\n");
      printf("0.返回上一级\r\n\r\n");
      printf("\r\n");
      printf("请输入序号,按回车选择:");

      scanf("%d", &nOption);
      getchar();

      switch (nOption)
      {
      case 1:
      {
        printf("请输入课程号:");
        scanf("%d", &nId);
        ShowCourses(FindCourse(nId));
      }
      break;
      case 2:
      {
        printf("请输入课程名:");
        scanf("%20s", szName);
        ShowCourses(FindCourse(szName));
      }
      break;
      case 3:
      {
        //显示课程
        ShowCourses();
      }
      break;
      case 0:
      {
        break;
      }
      }

      getchar();
    }
    break;
    case 0:
    {
      //跳出循环
      goto Exit_Point;
    }
    break;
    default:
      printf("没有这个选项!\r\n");
      getchar();
      break;
    }
  }
Exit_Point:
  ;
}

CCourseMgr::tagCourse * CCourseMgr::FindCourse(int nId)
{
  CMyTree<tagCourseId*>::TreeNode *pNode = m_CourseIdTree.Find(&tagCourseId(nId, ""));
  return pNode == nullptr ? nullptr : pNode->data;
}

CMyList<CCourseMgr::tagCourse*> CCourseMgr::FindCourse(const char * szName)
{
  CMyList<CCourseMgr::tagCourse*> CourseList;

  CMyTree<tagCourseName*>::TreeNode *pNode = m_CourseNameTree.Find(&tagCourseName(0, szName));

  //遍历
  while (pNode != nullptr)
  {
    CourseList.push_back(pNode->data);
    //往下迭代
    pNode = pNode->pNext;
  }
  return CourseList;
}

void CCourseMgr::ShowCourses(tagCourse * course)
{
  system("cls");
  printf("\r\n%s\t\t%s\r\n", "课程号", "课程名");
  printf("-------------------------------\r\n\r\n");
  if (course != nullptr)
  {
    printf("%d\t\t%s\r\n", course->m_nId, course->m_strName.GetStr());
  }
  else
  {
    printf("NONE!\r\n");
  }
  printf("\r\n-------------------------------\r\n\r\n");
  printf("按任意键继续...");
  getchar();
}

void CCourseMgr::ShowCourses(CMyList<tagCourse*> list)
{
  system("cls");
  printf("\r\n%s\t\t%s\r\n", "课程号", "课程名");
  printf("-------------------------------\r\n\r\n");
  if (!list.empty())
  {
    for (tagCourse* course : list)
    {
      printf("%d\t\t%s\r\n", course->m_nId, course->m_strName.GetStr());
    }
  }
  else
  {
    printf("NONE!\r\n");
  }
  printf("\r\n-------------------------------\r\n\r\n");
  printf("按任意键继续...");
  getchar();
}

void CCourseMgr::ShowCourses()
{
}

void CCourseMgr::ObjToFileObj(tagCourse * pCourse, tagFileCourse * pFileCourse)
{
  if (pCourse == nullptr || pFileCourse == nullptr)
  {
    return;
  }

  pFileCourse->m_nId = pCourse->m_nId;
  pFileCourse->m_nSize = 8 + pCourse->m_strName.GetStrlen();
  pFileCourse->m_szName = pCourse->m_strName.GetStr();
}

void CCourseMgr::flush()
{
  if (isChange)
  {
    write();
  }
}

void CCourseMgr::write()
{

  CMyQueue<CMyTree<tagCourseId *>::TreeNode*> que;
  tagCourseId** pCur = m_CourseIdTree.GetLayer(true, que);

  FILE *fp = fopen(FILE_COURSETREE, "wb");
  if (fp == nullptr)
  {
    goto ExitPoint;
  }

  if (pCur == nullptr)
  {
    return;
  }

  do
  {
    tagFileCourse fileCourse;
    ObjToFileObj(*pCur, &fileCourse);
    if (fwrite(&fileCourse, 8, 1, fp) != 1)
    {
      printf("写文件失败(CCourse)!\r\n");
      break;
    }
    if (fwrite(fileCourse.m_szName, (*pCur)->m_strName.GetStrlen(), 1, fp) != 1)
    {
      printf("写文件失败(CCourse)!\r\n");
      break;
    }
  }
  while ((pCur = m_CourseIdTree.GetLayer(false, que)) != nullptr);

ExitPoint:
  if (fp != nullptr)
  {
    fclose(fp);
  }

}

void CCourseMgr::read()
{
  int nObjSize = 0;

  FILE *fp = fopen(FILE_COURSETREE, "rb");
  if (fp == nullptr)
  {
    goto ExitProc;
  }

  //读取
  while (feof(fp) == 0) {
    //读取大小
    if (fread(&nObjSize, 4, 1, fp) != 1)
    {
      goto ExitProc;
    }

    //缓冲区
    char *pBuf = new char[nObjSize] { 0 };

    if (fread(pBuf, nObjSize - 4, 1, fp) != 1)
    {
      goto ExitProc;
    }

    //临时对象
    tagCourseId *obj = new tagCourseId();

    //构建
    obj->m_nId = *(int *)pBuf;

    //名字
    obj->m_strName = pBuf + 4;

    //读取成功,构建树
    m_CourseIdTree.insert(obj);
    m_CourseNameTree.insert(new tagCourseName(obj->m_nId, obj->m_strName));

    //释放
    if (pBuf != nullptr)
    {
      delete pBuf;
    }
  }

ExitProc:
  if (fp != nullptr)
  {
    fclose(fp);
  }
}

void CCourseMgr::generate()
{
  for (int i = 0; i < 1300; i++)
  {
    //插入树
    m_CourseIdTree.insert(new tagCourseId(COURSEID_START + i, CourseNames[i]));
  }
}
